package com.example.exchangeratesserver.client.model;

public enum ValuteCode {
    AUD("Австралийский доллар", 36, "R01010"),
    ATS("Австрийский шиллинг", 40, "R01015"),
    AZN("Азербайджанский манат", 944, "R01020A"),
    GBP("Фунт стерлингов Соединенного королевства", 826, "R01035"),
    AON("Ангольская новая кванза", 24, "R01040F"),
    AMD("Армянский драм", 51, "R01060"),
    BYN("Белорусский рубль", 933, "R01090B"),
    BEF("Бельгийский франк", 56, "R01095"),
    BGN("Болгарский лев", 975, "R01100"),
    BRL("Бразильский реал", 986, "R01115"),
    HUF("Венгерский форинт", 348, "R01135"),
    VND("Вьетнамский донг", 704, "R01150"),
    HKD("Гонконгский доллар", 344, "R01200"),
    GRD("Греческая драхма", 300, "R01205"),
    GEL("Грузинский лари", 981, "R01210"),
    DKK("Датская крона", 208, "R01215"),
    AED("Дирхам ОАЭ", 784, "R01230"),
    USD("Доллар США", 840, "R01235"),
    EUR("Евро", 978, "R01239"),
    EGP("Египетский фунт", 818, "R01240"),
    INR("Индийская рупия", 356, "R01270"),
    IDR("Индонезийская рупия", 360, "R01280"),
    IEP("Ирландский фунт", 372, "R01305"),
    ISK("Исландская крона", 352, "R01310"),
    ESP("Испанская песета", 724, "R01315"),
    ITL("Итальянская лира", 380, "R01325"),
    KZT("Казахстанский тенге", 398, "R01335"),
    CAD("Канадский доллар", 124, "R01350"),
    QAR("Катарский риал", 634, "R01355"),
    KGS("Киргизский сом", 417, "R01370"),
    CNY("Китайский юань", 156, "R01375"),
    KWD("Кувейтский динар", 414, "R01390"),
    LVL("Латвийский лат", 428, "R01405"),
    LBP("Ливанский фунт", 422, "R01420"),
    LTL("Литовский лит", 440, "R01435"),
    MDL("Молдавский лей", 498, "R01500"),
    DEM("Немецкая марка", 276, "R01510"),
    NLG("Нидерландский гульден", 528, "R01523"),
    NZD("Новозеландский доллар", 554, "R01530"),
    NOK("Норвежская крона", 578, "R01535"),
    PLN("Польский злотый", 985, "R01565"),
    PTE("Португальский эскудо", 620, "R01570"),
    ROL("Румынский лей", 642, "R01585"),
    RON("Румынский лей", 946, "R01585F"),
    XDR("СДР (специальные права заимствования)", 960, "R01589"),
    SGD("Сингапурский доллар", 702, "R01625"),
    SRD("Суринамский доллар", 968, "R01665A"),
    TJS("Таджикский сомони", 972, "R01670"),
    THB("Таиландский бат", 764, "R01675"),
    TRY("Турецкая лира", 949, "R01700J"),
    TMM("Туркменский манат", 795, "R01710"),
    TMT("Новый туркменский манат", 934, "R01710A"),
    UZS("Узбекский сум", 860, "R01717"),
    UAH("Украинская гривна", 980, "R01720"),
    FIM("Финляндская марка", 246, "R01740"),
    FRF("Французский франк", 250, "R01750"),
    CZK("Чешская крона", 203, "R01760"),
    SEK("Шведская крона", 752, "R01770"),
    CHF("Швейцарский франк", 756, "R01775"),
    XEU("ЭКЮ", 954, "R01790"),
    EEK("Эстонская крона", 233, "R01795"),
    YUN("Югославский новый динар", 890, "R01805"),
    RSD("Сербский динар", 941, "R01805F"),
    ZAR("Южноафриканский рэнд", 710, "R01810"),
    KRW("Вон Республики Корея", 410, "R01815"),
    JPY("Японская иена", 392, "R01820");

    private final String name;
    private final int isoCode;
    private final String centralBankCode;

    ValuteCode(String name, int isoCode, String centralBankCode) {
        this.centralBankCode = centralBankCode;
        this.name = name;
        this.isoCode = isoCode;
    }

    /**
     * Внутренний код, использующийся в базе ЦБ
     */
    public String getCentralBankCode() {
        return centralBankCode;
    }

    public String getName() {
        return name;
    }

    public int getIsoCode() {
        return isoCode;
    }
}
